a316363723/pr307-308/pr_307_308_2025_controlbox/HC32F4A0x_usbfs_library/usb_host/host_class/hid/usbh_hid_keybd.c
/******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co.,Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co.,Ltd ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file usbh_hid_keybd.c
 **
 ** A detailed description is available at
 ** @link
        This file is the application layer for USB Host HID Keyboard handling
        QWERTY and AZERTY Keyboard are supported as per the selection in
        usbh_hid_keybd.h
    @endlink
 **
 **   - 2019-12-13  1.0  zhangxl First version for USB HID keyboard demo.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "usbh_hid_keybd.h"
#include "ddl_config.h"
#include "hc32f4a0_utility.h"
#include "app_data_center.h"
/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
static void  KEYBRD_Init (void);
static void  KEYBRD_Decode(uint8_t *data);

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/
#ifdef USB_OTG_HS_INTERNAL_DMA_ENABLED
 #if defined   (__CC_ARM) /*!< ARM Compiler */
  __align(4)
 #elif defined ( __ICCARM__ ) /*!< IAR Compiler */
  #pragma data_alignment=4
 #elif defined (__GNUC__) /*!< GNU Compiler */
 #pragma pack(4)
 #endif /* __CC_ARM */
#endif

HID_cb_TypeDef HID_KEYBRD_cb=
{
    KEYBRD_Init,
    KEYBRD_Decode
};

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
static  const  uint8_t  HID_KEYBRD_Codes[] =
{
    0,      0,      0,      0,      31,     50,     48,     33,
    19,     34,     35,     36,     24,     37,     38,     39,     /* 0x00 - 0x0F */
    52,     51,     25,     26,     17,     20,     32,     21,
    23,     49,     18,     47,     22,     46,     2,      3,      /* 0x10 - 0x1F */
    4,      5,      6,      7,      8,      9,      10,     11,
    43,     110,    15,     16,     61,     12,     13,     27,     /* 0x20 - 0x2F */
    28,     29,     42,     40,     41,     1,      53,     54,
    55,     30,     112,    113,    114,    115,    116,    117,    /* 0x30 - 0x3F */
    118,    119,    120,    121,    122,    123,    124,    125,
    126,    75,     80,     85,     76,     81,     86,     89,     /* 0x40 - 0x4F */
    79,     84,     83,     90,     95,     100,    105,    106,
    108,    93,     98,     103,    92,     97,     102,    91,     /* 0x50 - 0x5F */
    96,     101,    99,     104,    45,     129,    0,      0,
    0,      0,      0,      0,      0,      0,      0,      0,      /* 0x60 - 0x6F */
    0,      0,      0,      0,      0,      0,      0,      0,
    0,      0,      0,      0,      0,      0,      0,      0,      /* 0x70 - 0x7F */
    0,      0,      0,      0,      0,      107,    0,      56,
    0,      0,      0,      0,      0,      0,      0,      0,      /* 0x80 - 0x8F */
    0,      0,      0,      0,      0,      0,      0,      0,
    0,      0,      0,      0,      0,      0,      0,      0,      /* 0x90 - 0x9F */
    0,      0,      0,      0,      0,      0,      0,      0,
    0,      0,      0,      0,      0,      0,      0,      0,      /* 0xA0 - 0xAF */
    0,      0,      0,      0,      0,      0,      0,      0,
    0,      0,      0,      0,      0,      0,      0,      0,      /* 0xB0 - 0xBF */
    0,      0,      0,      0,      0,      0,      0,      0,
    0,      0,      0,      0,      0,      0,      0,      0,      /* 0xC0 - 0xCF */
    0,      0,      0,      0,      0,      0,      0,      0,
    0,      0,      0,      0,      0,      0,      0,      0,      /* 0xD0 - 0xDF */
    58,     44,     60,     127,    64,     57,     62,     128     /* 0xE0 - 0xE7 */
};

#ifdef QWERTY_KEYBOARD
static  const  int8_t  HID_KEYBRD_Key[] =
{
    '\0',   '`' ,   '1' ,   '2' ,   '3' ,   '4' ,   '5' ,   '6' ,
    '7' ,   '8' ,   '9' ,   '0' ,   '-' ,   '=' ,   '\0',   '\r',
    '\t',   'q' ,   'w' ,   'e' ,   'r' ,   't' ,   'y' ,   'u' ,
    'i' ,   'o' ,   'p' ,   '[' ,   ']' ,   '\\',
    '\0',   'a' ,   's' ,   'd' ,   'f' ,   'g' ,   'h' ,   'j' ,
    'k' ,   'l' ,   ';' ,   '\'',   '\0',   '\n',
    '\0',   '\0',   'z' ,   'x' ,   'c' ,   'v' ,   'b' ,   'n' ,
    'm' ,   ',' ,   '.' ,   '/' ,   '\0',   '\0',
    '\0',   '\0',   '\0',   ' ' ,   '\0',   '\0',   '\0',   '\0',
    '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',
    '\0',   '\0',   '\0',   '\0',   '\0',   '\r',   '\0',   '\0',
    '\0',   '\0',   '\0',   '\0',   '\0',   '\0',
    '\0',   '\0',   '7' ,   '4' ,   '1' ,
    '\0',   '/',    '8' ,   '5' ,   '2' ,
    '0' ,   '*',    '9' ,   '6' ,   '3' ,
    '.' ,   '-',    '+' ,   '\0',   '\n',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',
    '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',
    '\0',   '\0',   '\0',   '\0'
};

static  const  int8_t  HID_KEYBRD_ShiftKey[] = {
    '\0',   '~' ,   '!' ,   '@' ,   '#' ,   '$' ,   '%' ,   '^' ,   '&' ,   '*' ,   '(' ,   ')' ,
    '_' ,   '+' ,   '\0',   '\0',   '\0',   'Q' ,   'W' ,   'E' ,   'R' ,   'T' ,   'Y' ,   'U' ,
    'I' ,   'O' ,   'P' ,   '{' ,   '}' ,   '|' ,   '\0',   'A' ,   'S' ,   'D' ,   'F' ,   'G' ,
    'H' ,   'J' ,   'K' ,   'L' ,   ':' ,   '"' ,   '\0',   '\n',   '\0',   '\0',   'Z' ,   'X' ,
    'C' ,   'V' ,   'B' ,   'N' ,   'M' ,   '<' ,   '>' ,   '?' ,   '\0',   '\0',   '\0',   '\0',
    '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',
    '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',
    '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',
    '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',
    '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',
    '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0'
};

#else

static  const  int8_t  HID_KEYBRD_Key[] = {
    '\0',   '`' ,   '1' ,   '2' ,   '3' ,   '4' ,   '5' ,   '6' ,   '7' ,   '8' ,   '9' ,   '0',
    '-' ,   '=' ,   '\0',   '\r',   '\t',   'a' ,   'z' ,   'e' ,   'r' ,   't' ,   'y' ,   'u',
    'i' ,   'o' ,   'p' ,   '[' ,   ']' ,   '\\',   '\0',   'q' ,   's' ,   'd' ,   'f' ,   'g',
    'h' ,   'j' ,   'k' ,   'l' ,   'm' ,   '\0',   '\0',   '\n',   '\0',   '\0',   'w' ,   'x',
    'c' ,   'v' ,   'b' ,   'n' ,   ',' ,   ';' ,   ':' ,   '!' ,   '\0',   '\0',   '\0',   '\0',
    '\0',   ' ' ,   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',
    '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\r',   '\0',   '\0',   '\0',
    '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '7' ,   '4' ,   '1' ,   '\0',   '/',
    '8' ,   '5' ,   '2' ,   '0' ,   '*' ,   '9' ,   '6' ,   '3' ,   '.' ,   '-' ,   '+' ,   '\0',
    '\n',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',
    '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0'
};

static  const  int8_t  HID_KEYBRD_ShiftKey[] = {
    '\0',   '~' ,   '!' ,   '@' ,   '#' ,   '$' ,   '%' ,   '^' ,   '&' ,   '*' ,   '(' ,   ')' ,   '_' ,
    '+' ,   '\0',   '\0',   '\0',   'A' ,   'Z' ,   'E' ,   'R' ,   'T' ,   'Y' ,   'U' ,   'I' ,   'O' ,
    'P' ,   '{' ,   '}' ,   '*' ,   '\0',   'Q' ,   'S' ,   'D' ,   'F' ,   'G' ,   'H' ,   'J' ,   'K' ,
    'L' ,   'M' ,   '%' ,   '\0',   '\n',   '\0',   '\0',   'W' ,   'X' ,   'C' ,   'V' ,   'B' ,   'N' ,
    '?' ,   '.' ,   '/' ,   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',
    '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',
    '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',
    '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',
    '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',
    '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0',   '\0'
};
#endif

/**
* @brief  USR_KEYBRD_Init
*         Init Keyboard window
* @param  None
* @retval None
*/
static void USR_KEYBRD_Init (void)
{
#if (DDL_PRINT_ENABLE == DDL_ON)
    //printf((void*)USB_HID_KeybrdStatus);
    Debug("> Use Keyboard to tape characters: \n\n");
    Debug("\n\n\n\n\n\n");
#endif
//    KeybrdCharXpos = KYBRD_FIRST_LINE;
//    KeybrdCharYpos = KYBRD_FIRST_COLUMN;
}

/**
* @brief  KEYBRD_Init.
*         Initialize the keyboard function.
* @param  None
* @retval None
*/
static void  KEYBRD_Init (void)
{
    /* Call User Init*/
    USR_KEYBRD_Init();
}

/**
* @brief  USR_KEYBRD_ProcessData
*         Process Keyboard data
* @param  data      Keyboard data to be displayed
* @retval None
*/
static void  USR_KEYBRD_ProcessData (uint8_t data)
{
	static uint8_t data_num = 0;
	static char Idata[20];
#if (DDL_PRINT_ENABLE == DDL_ON)
    printf("%c", (char)data);
#endif
	
//	//TODO
	if(data == 0x0A)
	{
//		if( memcmp("6LY",&Idata,3) == 0 && ii == 11 && ( 64 < Idata[5] &&  Idata[5] < 91 ) )
//		{
            data_center_write_config_data_no_event(SYS_CONFIG_UUID, Idata);
			memset(&Idata, 0, 20);
//		}
		memset(&Idata,0,20);
		data_num = 0;
		
	}
	else
	{
		//memset(&FrameFlag.ProInformation_Data, 0, 20);
		Idata[data_num] = data ;
		data_num ++ ;
	}
	
}

/**
* @brief  KEYBRD_ProcessData.
*         The function is to decode the pressed keys.
* @param  pbuf : Pointer to the HID IN report data buffer
* @retval None
*/
static void KEYBRD_Decode(uint8_t *pbuf)
{
    static  uint8_t   shift;
    static  uint8_t   keys[KBR_MAX_NBR_PRESSED];
    static  uint8_t   keys_new[KBR_MAX_NBR_PRESSED];
    static  uint8_t   keys_last[KBR_MAX_NBR_PRESSED];
    static  uint8_t   key_newest;
    static  uint8_t   nbr_keys;
    static  uint8_t   nbr_keys_new;
    static  uint8_t   nbr_keys_last;
    uint8_t   ix;
    uint8_t   jx;
    uint8_t   error;
    uint8_t   output;

    nbr_keys      = 0;
    nbr_keys_new  = 0;
    nbr_keys_last = 0;
    key_newest    = 0x00;


    /* Check if Shift key is pressed */
    if ((pbuf[1] == KBD_LEFT_SHIFT) || (pbuf[1] == KBD_RIGHT_SHIFT))   //chen 扫码枪设备第二个字节才是
    {
        shift = TRUE;
    }
    else
    {
        shift = FALSE;
    }

    error = FALSE;

    /* Check for the value of pressed key */
    for (ix = 2; ix < 2 + KBR_MAX_NBR_PRESSED; ix++)
    {
        if ((pbuf[ix] == 0x01) || (pbuf[ix] == 0x02) || (pbuf[ix] == 0x03))
        {
            error = TRUE;
        }
    }
    if (error == TRUE)
    {
        return;
    }
    nbr_keys     = 0;
    nbr_keys_new = 0;
    for (ix = 2; ix < 2 + KBR_MAX_NBR_PRESSED; ix++)
    {
        if (pbuf[ix] != 0)
        {
            keys[nbr_keys] = pbuf[ix];
            nbr_keys++;
            for (jx = 0; jx < nbr_keys_last; jx++)
            {
                if (pbuf[ix] == keys_last[jx])
                {
                    break;
                }
            }
            if (jx == nbr_keys_last)
            {
                keys_new[nbr_keys_new] = pbuf[ix];
                nbr_keys_new++;
            }
        }
    }
    if (nbr_keys_new == 1)
    {
        key_newest = keys_new[0];

        if (shift == TRUE)
        {
            output = HID_KEYBRD_ShiftKey[HID_KEYBRD_Codes[key_newest]];
        }
        else
        {
            output = HID_KEYBRD_Key[HID_KEYBRD_Codes[key_newest]];
        }
        /* call user process handle */
        USR_KEYBRD_ProcessData(output);
    }
    else
    {
        key_newest = 0x00;
    }
    nbr_keys_last  = nbr_keys;
    for (ix = 0; ix < KBR_MAX_NBR_PRESSED; ix++)
    {
        keys_last[ix] = keys[ix];
    }
}

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
